In [2]:
import pandas as pd
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

df = pd.DataFrame([record1, record2, record3], index=['school1', 'school2', 'school3'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [3]:
df.loc['school1']

Name       Alice
Class    Physics
Score         85
Name: school1, dtype: object

In [6]:
df.T

       school1    school2  school3
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [7]:
df.T.loc['Class']

school1      Physics
school2    Chemistry
school3      Biology
Name: Class, dtype: object

In [8]:
# small tutorial of getting data from api and seeing with pandas
import requests
import numpy as np
import pandas as pd
import json
response = requests.get("http://universities.hipolabs.com/search?country=United+States")
#print(response)
data = response.json()
df = pd.DataFrame(data)
df

,state-province,country,web_pages,name,alpha_two_code,domains
0,None,United States,[http://www.marywood.edu],Marywood University,US,[marywood.edu]
1,None,United States,[http://www.lindenwood.edu/],Lindenwood University,US,[lindenwood.edu]
2,None,United States,[https://sullivan.edu/],Sullivan University,US,[sullivan.edu]
3,None,United States,[https://www.fscj.edu/],Florida State College at Jacksonville,US,[fscj.edu]
4,None,United States,[https://www.xavier.edu/],Xavier University,US,[xavier.edu]
...,...,...,...,...,...,...
4341,Florida,United States,[https://www.gulfcoast.edu/],Gulf Coast State College,US,[gulfcoast.edu]
4342,California,United States,[https://www.academyart.edu/],Academy of Art University,US,"[academyart.edu, art.edu]"
4343,North Carolina,United States,[https://www.lr.edu/],Lenoir-Rhyne University,US,[lr.edu]
4344,Pennsylvania,United States,[https://pointpark.edu/],Point Park University,US,[pointpark.edu]
4345,Michigan,United States,[https://northwood.edu/],Northwood University,US,[northwood.edu]

In [9]:
df.loc[2]

state-province                       None
country                     United States
web_pages         [https://sullivan.edu/]
name                  Sullivan University
alpha_two_code                         US
domains                    [sullivan.edu]
Name: 2, dtype: object

In [12]:
df['web_pages']

0           [http://www.marywood.edu]
1        [http://www.lindenwood.edu/]
2             [https://sullivan.edu/]
3             [https://www.fscj.edu/]
4           [https://www.xavier.edu/]
                    ...
4341     [https://www.gulfcoast.edu/]
4342    [https://www.academyart.edu/]
4343            [https://www.lr.edu/]
4344         [https://pointpark.edu/]
4345         [https://northwood.edu/]
Name: web_pages, Length: 4346, dtype: object

In [13]:
web_df = df['web_pages']

In [18]:
web_df[:10]

0        [http://www.marywood.edu]
1     [http://www.lindenwood.edu/]
2          [https://sullivan.edu/]
3          [https://www.fscj.edu/]
4        [https://www.xavier.edu/]
5     [https://home.tusculum.edu/]
6               [https://cst.edu/]
7    [https://www.columbiasc.edu/]
8         [http://www.clpccd.edu/]
9        [https://www.keller.edu/]
Name: web_pages, dtype: object